In [2]:
import pandas as pd

data1 = {
    'StudentID': [101, 102, 103, 104, 105],
    'Name': ['Asha', 'Bhavesh', 'Chirag', 'Diksha', 'Esha'],
    'City': ['Mumbai', 'Pune', 'Delhi', 'Bangalore', 'Hyderabad']
}

df_students = pd.DataFrame(data1)

data2 = {
    'StudentID': [101, 102, 103, 106],
    'Marks': [85, None, 78, 92],
    'FeesPaid': [True, False, True, True]
}

df_scores = pd.DataFrame(data2)

df_merge = pd.merge(df_students, df_scores, on='StudentID', how='right')
print(df_merge)

   StudentID     Name    City  Marks  FeesPaid
0        101     Asha  Mumbai   85.0      True
1        102  Bhavesh    Pune    NaN     False
2        103   Chirag   Delhi   78.0      True
3        106      NaN     NaN   92.0      True

In [11]:
import pandas as pd

data1 = {
    'StudentID': [101, 102, 103, 104, 105],
    'Name': ['Asha', 'Bhavesh', 'Chirag', 'Diksha', 'Esha'],
    'City': ['Mumbai', 'Pune', 'Delhi', 'Bangalore', 'Hyderabad']
}

df_students = pd.DataFrame(data1)

data2 = {
    'StudentID': [101, 102, 103, 106],
    'Marks': [85, None, 78, 92],
    'FeesPaid': [True, False, True, True]
}

df_scores = pd.DataFrame(data2)

df_merge['Marks'] = df_merge['Marks'].fillna(df_merge['Marks'].mean())
print(df_merge)

   StudentID     Name       City  Marks FeesPaid
0        101     Asha     Mumbai   85.0     True
1        102  Bhavesh       Pune   85.0    False
2        103   Chirag      Delhi   78.0     True
3        104   Diksha  Bangalore   85.0      NaN
4        105     Esha  Hyderabad   85.0      NaN
5        106      NaN        NaN   92.0     True

In [10]:
sorted_df = df_merge.sort_values(by='Marks', ascending=False)
print(sorted_df)

   StudentID     Name       City  Marks FeesPaid
5        106      NaN        NaN   92.0     True
0        101     Asha     Mumbai   85.0     True
1        102  Bhavesh       Pune   85.0    False
3        104   Diksha  Bangalore   85.0      NaN
4        105     Esha  Hyderabad   85.0      NaN
2        103   Chirag      Delhi   78.0     True

In [9]:
cleaned_df = df_merge.dropna(subset=['Name'])
print(cleaned_df)

   StudentID     Name       City  Marks FeesPaid
0        101     Asha     Mumbai   85.0     True
1        102  Bhavesh       Pune   85.0    False
2        103   Chirag      Delhi   78.0     True
3        104   Diksha  Bangalore   85.0      NaN
4        105     Esha  Hyderabad   85.0      NaN

In [13]:
df_merge['Marks'] = df_merge['Marks'].interpolate(method='linear')
print(df_merge)

   StudentID     Name       City  Marks FeesPaid
0        101     Asha     Mumbai   85.0     True
1        102  Bhavesh       Pune   85.0    False
2        103   Chirag      Delhi   78.0     True
3        104   Diksha  Bangalore   85.0      NaN
4        105     Esha  Hyderabad   85.0      NaN
5        106      NaN        NaN   92.0     True

In [14]:
grouped = cleaned_df.groupby('City')['Marks'].mean()
print(grouped)

City
Bangalore    85.0
Delhi        78.0
Hyderabad    85.0
Mumbai       85.0
Pune         85.0
Name: Marks, dtype: float64